<script>
	const instruction = [
		[
			`Перед началом ретроспективы, фасилитатор должен объяснить, как работает
    техника, и предоставить команде время для ретроспективы (1-2 часа, в
    зависимости от размера команды).`,
			`Определитесь с продолжительностью вашей встречи`,
			``
		],
		[`Сколько планируете отвести времени на .. генерирование тем?`, ``, ``],
		[`Сколько планируете отвести времени на .. отбор голосование за темы?`, ``, ``],
		[`Сколько планируете отвести времени на обсуждение всех тем?`, ``, ``],
		[`Сколько планируете отвести времени на обсуждение одной темы ?`, ``, ``]
	];

	export let step,
		instructionLength = instruction.length;
</script>

{#each instruction[step] as instruction}
	<p class="mb-3 font-normal text-gray-100 leading-tight">
		{instruction}
	</p>
{/each}
